// 25. Вывести на экран кубы чисел от 1 до N

int N=Convert.ToInt32(Console.ReadLine());
for (int a=1;a<=N;a++)
{
    System.Console.Write($"{a*a*a} ");
}