// Вывести на экран последнюю цифру целого числа введенного с клавиатуры. 

//System.Console.WriteLine("Введите число:");
//string? a = Console.ReadLine();

int a=315;
System.Console.WriteLine(a/1%10);